Repository: playday3008/SynCE
Catalog: synce-kde/po/*.po
Languages: it

source: Nothing to configure.
it: Nulla da configurare.

source: _: NAME OF TRANSLATORS Your names
it: Alessandro Galli

source: _: EMAIL OF TRANSLATORS Your emails
it: alessandro.galli@gmail.com

source: Could not copy a valid dccm.sh script. Error was: %1 Please check your installation and start again!
it: Non posso copiare uno script dccm.sh valido. L'errore è stato: %1 Ricontrolla la tua installazione e riprova!

source: Win CE version unknown
it: Versione di Win CE sconosciuta

source: PDA-Processor unknown
it: Processore del PDA sconosciuto

source: Battery state-high
it: Stato batteria carica

source: Battery state-low
it: Stato batteria quasi scarica

source: Battery state-critical
it: Stato batteria scarica

source: Battery state-charging
it: Stato batteria in ricarica

source: Battery state-nobattery
it: Stato batteria assente

source: Battery state-unknown
it: Stato batteria sconosciuto

source: Ready
it: Pronto

source: Processor architecture
it: Architettura processore

source: Battery
it: Batteria

source: Uninstalling software ...
it: Disinstallazione software...

source: Retrieve system-info ...
it: Raccolta informazioni sul sistema...

source: Retrieve battery-info ...
it: Raccolta informazioni sulla batteria...

source: Retrieve software-list ...
it: Raccolta lista dei programmi...

source: Matchmaker-Connect
it: Connetti Matchmaker

source: Matchmaker-Disconnect
it: Disconnetti Matchmacher

source: Partnership creation succeeded. Using partnership index %1
it: Creazione della partnership completata. Verrà usato l'indice di partnership %1

source: Partnership creation failed.
it: Creazione della partnership fallita.

source: Partnership replacement succeeded.
it: Rimpiazzo della partnership avvenuta con successo.

source: Partnership replacement failed.
it: Rimpiazzo della partneship fallita.

source: Invalid or missing index of partnership to replace.
it: L'indice della partnership da sotituire assente o non valido.

source: Execute on %1
it: Esegui su %1

source: Info and Management for %1
it: Informazioni e gestione per %1

source: Password for %1
it: Password per %1

source: Configuration for %1
it: Configurazione per %1

source: Synchronize %1
it: Sincronizza %1

source: &Synchronize
it: &Sincronizza

source: &Info && Management...
it: &Informazioni e Management

source: &Open %1
it: &Apri %1

source: Run &KCeMirror
it: Avvia &KCeMirror

source: &Execute...
it: &Esegui...

source: Configure %1
it: Configura %1

source: Deleting PDA
it: Cancella PDA

source: There are already two partnerships configured on the device - using guest
it: Ci sono già due partnership configurate nel dispositivo - verrà usata la modalità ospite

source: Error configuring partnership
it: Errore nella configurazione della partnership

source: A Partnership with name %1 already exists on the desktop side. Should this partnership be replaced?
it: Esiste già una partnership con nome %1 lato desktop. Deve essere rimpiazzata?

source: Could not create a RRA-connection
it: Non riesco a creare una connessione RRA

source: Using Guest
it: Modalità guest

source: Partnership already known but id not valid
it: Partnership conosciuta ma con un id non valido

source: Should ask user if partnership should be deleted
it: Chiedi all'utente se la partnership deve essere cancellata

source: Configuration of %1
it: Configurazione di %1

source: New Partnership created
it: Creata la nuova Partnership

source: Guest
it: Ospite

source: Partnership known
it: Partnership conosciuta

source: Using guest partnership
it: Utilizzo la partnership ospite

source: PDA-init
it: PDA-inizializzazione

source: End PDA::syncronizationTasks()
it: Fine PDA::syncronizationTasks()

source: Partnership created:
it: Partnership creata:

source: Connected Devices
it: Dispositivi connessi

source: Raki Applet
it: Applet Raki

source: &Start DCCM
it: &Avvia DCCM

source: S&top DCCM
it: A&rresta DCCM

source: &Configure...
it: &Configura...

source: Password for PDA " %1 " invalid!
it: Password errata per il PDA "%1"!

source: Could not start dccm or dccm has exited. Maybe there is already a dccm running
it: Non riesco ad avviare dccm o dccm è uscito. Forse c'è già un server dccm avviato.

source: Devices
it: Dispositivi

source: Name:
it: Nome:

source: No Device connected
it: Nessun dispositivo connesso

source: Could not create masqueraded route
it: Non riesco a creare la route per utilizzare masquerade (NAT)

source: Masqueraded route created
it: Route per il masquerade creata

source: iptables terminated due to a signal
it: A causa di un segnale iptables è stato interrotto

source: Could not start iptables
it: Non riesco ad avviare iptables

source: Anonymous
it: Anonimo

source: is the Initiator of the SynCE-Project.
it: è il creatore del progetto SynCE

source: is the current Project Manager.
it: è l'attuale Project Manager.

source: has developed the serial-over-USB driver.
it: ha sviluppato il driver serial-over-USB.

source: ported the AvantGo support from Malsync to SynCE.
it: ha fatto il porting del supporto ad AvantGo da Malsync a SynCE

source: Raki Configuration
it: Configurazione di Raki

source: Connection Setting
it: Impostazioni di connessione

source: Start dccm at start up
it: Avvia dccm all'avvio

source: Path to dccm:
it: Percorso per dccm:

source: Notifications
it: Notifiche

source: Connect:
it: Connetti:

source: Disconnect:
it: Disconnetti:

source: Password Request:
it: Richiesta password:

source: Password Rejected:
it: Password rifiutata:

source: Path to IP-Tables:
it: Percorso per iptables:

source: Installation
it: Installazione

source: Destination:
it: Destinazione:

source: &Install
it: &Installa

source: PDA Info and Management
it: Informazioni e gestione PDA

source: System Information
it: Informazioni sistema

source: System
it: Sistema

source: Major
it: Maggiore

source: Minor
it: Minore

source: Name
it: Nome

source: Platform
it: Piattaforma

source: Details
it: Dettagli

source: Processor
it: Processore

source: Architecture
it: Architettura

source: Type
it: Tipo

source: Page size
it: Dimensione pagina

source: Size
it: Dimensione

source: Free
it: Liberi

source: Refresh
it: Aggiorna

source: Power status
it: Stato alimentazione

source: AC Power Status
it: Stato alimentazione AC

source: Online
it: Collegato

source: Offline
it: Scollegato

source: Backup Power
it: Alimentazione di backup

source: Invalid
it: Non valido

source: Main Battery
it: Batteria principale

source: LifePercent
it: Percentuale vita

source: LifeTime
it: Tempo rimanente

source: FullLifeTime
it: Tempo totale

source: Backup Battery
it: Batteria di backup

source: Software Manager
it: Gestione programmi

source: Installed Software
it: Programmi installati

source: Uninstall
it: Disinstalla

source: Status Information:
it: Informazioni di stato:

source: PasswordDialog
it: Maschera password

source: Enter Password for
it: Inserici una password per

source: Remember Password
it: Ricorda password

source: Pda Configuration
it: Configurazione Pda

source: Enable Masquerading:
it: Abilita masquerading:

source: Synchronization Settings
it: Impostazioni di sincronizzazione

source: Possible Synchronization Types
it: Tipi di sincronizzazione possibili

source: Syncronize at PDA-Connect
it: Sincronizza al momento della connessione del PDA

source: Remove Partnership
it: Rimuovi la partnership

source: There are already two partnerships configured on the device.<br>You have to delete at least one before you can set up a new partnership.
it: Ci sono già due partnerships configurate nul dispositivo.<br>Devi cancellarne almeno una prima di creare una nuova partnership.

source: Current Partnerships
it: Partnership corrente

source: Remove marked Partnerships
it: Rimuovi le partnerships selezionate

source: Execute on PDA
it: Esegui sul PDA

source: File to execute: (rapip:/)
it: File da eseguire: (rapip:/)

source: Execute
it: Esegui

source: Replication
it: Replica

source: Replication Task
it: Attività di replica

source: Comment
it: Commento

source: Progress
it: Avanzamento

source: WelcomeDialog
it: MascheraDiBenvenuto

source: <p align="center">Welcome to Raki</p>
it: <p align="center">Benvenuto a Raki</p>

source: You have either started Raki for the first time, or you have just
it: O hai avviato Raki per la prima volta o hai

source: upgraded from a previous release. In case of upgrade, please
it: aggiornato da una versione precedente. In caso di upgrade, ti prego

source: remove your previous raki.sh script from the ~/.synce/scripts
it: di rimuovere lo script raki.sh precedente dalla cartella ~/.synce/scripts

source: directory before you continue.
it: prima di continuare.

source: In order to work properly, Raki needs to know
it: Per lavorare in modo corretto, Raki deve conoscere

source: the version of dccm you want to use. It is
it: la versione di dccm che vuoi utilizzare. E'

source: recommended to use vdccm because it enables
it: raccomandato utilizzare vdccm perchè abilita

source: the "multiple-devices" feature of Raki.
it: la possibilità di collegare più devices contemporaneamente.

source: This dialog will not appear again!
it: Questa maschera non apparirà più!

source: Removing partnerships
it: Stò rimuovendo le partnerships

source: RRA-Connect
it: Connetti RRA

source: RRA-Disconnect
it: Disconnetti RRA

source: -------- unchanged --------
it: -------- invariato --------

source: --------- changed ---------
it: --------- modificato ---------

source: --------- deleted ---------
it: --------- cancellato ---------

source: Waiting...
it: Attendi...

source: Select Name:
it: Scegli il nome:

source: Library:
it: Libreria:

source: Services for
it: Servizi per

source: There was an error:
it: C'è stato un errore:

source: Library no Raki-Plugin
it: La libreria non è un plugin Raki

source: No Synchronizer found for
it: Non ho trovato nessun sincronizzatore per

source: Wrong library type for
it: Tipo di libreria sbagliato per

source: Started
it: Iniziato

source: Started syncing with
it: Iniziata la sincronizzazione con

source: Finished syncing with
it: Finita la sincronizzazione con

source: Finished
it: Finito

source: Error during synchronization
it: Errore durante la sincronizzazione

source: CurrentTime (UTC):
it: Ora corrente (UTC):

source: CurrentTime (LOCAL):
it: Ora corrente (LOCAL):

source: Name1:
it: Nome1:

source: Daylight
it: Giorno

source: ERROR ON COMMAND
it: ERRORE NEL COMANDO

source: AvantGo error on asStartServer:
it: Errore AvantGo su asStartServer:

source: Beginning synchonization attempt on server.
it: Inizio tentativo di sincronizzazione con il server.

source: Failed to retrieve device information!
it: Incapace di recuperare le informazioni sul server!

source: Avantgo error on asEndServer:
it: Errrore di AvantGo su asEndServer:

source: The AvantGo Client has been installed on your device. Please finish the installation on the device but do not restart it until the first synchronization has finished! Press <OK> to start syncing your AvantGo channels
it: Il client AvantGo è stato installato sul vostro dispositivo. Per piacere concludi l'installazione sul dispositivo ma non riavviarlo fino a che la prima sincronizzazione non è finita! Premi <OK> per iniziare la sincronizzazione dei vostri canali AvantGo

source: AvantGo Client installed
it: Client AvantGo installato

source: Failed to receive user configuration from device.
it: Incapace di recuperare la configurazione dell'utente dal dispositivo.

source: Processing %1 servers.
it: Attualmente in elaborazione %1 servers.

source: Failed to store user configuration to device.
it: Fallito il salvataggio della configurazione dell'utente nel dispositivo.

source: Using HttpProxy
it: HttpProxy utilizzato

source: Using HttpProxy Authentification
it: HttpProxy Autentificazione utilizzata

source: Using SocksProxy
it: SocksProxy utilizzato

source: AvantGo Synchronizer
it: Sincronizzatore AvantGo

source: Server/Client Setting
it: Impostazioni Server/Client

source: Server Setting
it: Impostazioni server

source: Server Name
it: Nome server

source: Server Port
it: Porta del server

source: Client Setting
it: Impostazioni client

source: Install AvantGo Client-Software on the Device at next Sync
it: Installa il client AvantGo sul dispositivo alla prossima sincronizzazione

source: It's best practis to let it like it is.
it: E' consigliato lasciare l'impostazione di default.

source: Proxy Setting
it: Impostazioni proxy

source: HTTP Proxy
it: Proxy HTTP

source: Port:
it: Porta:

source: Use Authentication
it: Usa autentificazione

source: Username:
it: Nome utente:

source: Active Proxy
it: Attiva Proxy

source: No Proxy
it: Nessun Proxy

source: Server address
it: Indirizzo Server

source: Hostname:
it: Nome host:

source: Your account
it: Account
