Repository: playday3008/SynCE
Catalog: rapip/po/*.po
Languages: de

source: Nothing to configure.
de: Nichts zu konfigurieren

source: _: NAME OF TRANSLATORS Your names
de: Volker Christian

source: _: EMAIL OF TRANSLATORS Your emails
de: voc@users.sourceforge.net

source: Could not copy a valid dccm.sh script. Error was: %1 Please check your installation and start again!
de: Konnte kein geeignetes dccm.sh Skript kopieren Fehler: %1 Bitte prüfen Sie Ihre Installation und starten sie RAKI nochmals!

source: Win CE version unknown
de: Win CE Version Unbekannt

source: PDA-Processor unknown
de: PDA-Prozessor Unbekannt

source: Battery state-high
de: Batterie Status-hoch

source: Battery state-low
de: Batterie Status-nieder

source: Battery state-critical
de: Batterie Status-kritisch

source: Battery state-charging
de: Batterie Status-laden

source: Battery state-nobattery
de: Batterie Status-keinebatterie

source: Battery state-unknown
de: Batterie Status-unbekannt

source: Ready
de: Fertig

source: Processor architecture
de: Architektur

source: Battery
de: Batterie

source: Uninstalling software ...
de: Deinstalliere Software ...

source: Retrieve system-info ...
de: Systeminformation abrufen ...

source: Retrieve battery-info ...
de: Batterie Information abrufen ...

source: Retrieve software-list ...
de: Softwareliste abrufen ...

source: Matchmaker-Connect
de: Matchmaker-Verbinde

source: Matchmaker-Disconnect
de: Matchmaker-Trenne

source: Partnership creation failed.
de: Partnerschaftserstellung fehlgeschlagen.

source: Partnership replacement succeeded.
de: Pertnerschaftsersetzung erfolgreich.

source: Partnership replacement failed.
de: Partnerschaftsersetzung fehlgeschlagen.

source: Invalid or missing index of partnership to replace.
de: Fasche oder fehlende Partnerschaft zu ersetzen

source: Execute on %1
de: Starten auf %1

source: Info and Management for %1
de: Information und Verwaltung für %1

source: Password for %1
de: Passwort für %1

source: Configuration for %1
de: Konfiguration für %1

source: Synchronize %1
de: Synchronisation %1

source: &Synchronize
de: &Synchronisation

source: &Info && Management...
de: &Info && Verwaltung...

source: &Open %1
de: &Öffne %1

source: Run &KCeMirror
de: Start &KCeMirror

source: &Execute...
de: %Ausführen...

source: Configure %1
de: Konfiguration %1

source: Deleting PDA
de: Lösche PDA

source: There are already two partnerships configured on the device - using guest
de: Es existieren bereits zwei Partnerschaften auf dem Device - verwende Guest

source: Error configuring partnership
de: Error bei der erstellung einer Partnerschaft

source: A Partnership with name %1 already exists on the desktop side. Should this partnership be replaced?
de: Eine Partnerschaft mit Namen %1 existiert schon auf der Desktopseite. Soll diese Partnerschaft ersetzt werden?

source: Could not create a RRA-connection
de: Kann keine RRA-Verbindung aufbauen

source: Using Guest
de: Verwende Guest

source: Partnership already known but id not valid
de: Partnerschaft ist bekannt aber nicht gültig

source: Should ask user if partnership should be deleted
de: Sollte Benutzer fragen ob die Partnerschaft gelöscht werden soll

source: Configuration of %1
de: Konfiguration von %1

source: New Partnership created
de: Neue Partnerschaft erstellt

source: Partnership known
de: Partnerschaft unbekannt

source: Using guest partnership
de: Verwende Guest Partnerschaft

source: End PDA::syncronizationTasks()
de: Ende PDA::synchronisation Task

source: Partnership created:
de: Partnerschaft erstellt

source: Connected Devices
de: Verbundene Geräte

source: &Configure...
de: &Konfiguration...

source: Password for PDA " %1 " invalid!
de: Passwort für PDA " %1 " ungültig!

source: Could not start dccm or dccm has exited. Maybe there is already a dccm running
de: Kann DCCM nicht starten oder DCCM wurde beendet. Vielleicht wird eine Instanz von DCCM schon ausgeführt

source: Devices
de: Geräte

source: No Device connected
de: Kein Gerät verbunden

source: Could not create masqueraded route
de: Kann keine "masqueraded route" erstellen

source: Masqueraded route created
de: "Masqueraded route" erstellt

source: iptables terminated due to a signal
de: iptables wurde nicht ordnungsgemäß beendet

source: Could not start iptables
de: Iptables kann nicht gestartet werden

source: is the Initiator of the SynCE-Project.
de: ist der Initiator der SynCE-Projektes

source: is the current Project Manager.
de: ist der gegenwärtige Projektmanager

source: has developed the serial-over-USB driver.
de: hat den USB driver entwickelt

source: ported the AvantGo support from Malsync to SynCE.
de: hat die AvantGo unterstützung von Malsync nach SynCE protiert

source: Raki Configuration
de: Raki Konfiguration

source: Connection Setting
de: Verbindungseinstellungen

source: Start dccm at start up
de: Start DCCM automatisch zu Programmstart

source: Path to dccm:
de: Pfad zu DCCM

source: Notifications
de: Signale

source: Connect:
de: Verbinden:

source: Disconnect:
de: Trennen:

source: Password Request:
de: Passwort Anfrage:

source: Password Rejected:
de: Passwort abgelehnt:

source: Path to IP-Tables:
de: Pfad zu IP-Tables

source: Destination:
de: Ziel:

source: &Install
de: &Installation

source: Alt+I
de: Ali+I

source: PDA Info and Management
de: PDA Info und Verwaltung

source: Platform
de: Plattform

source: Details
de: Einzelheiten

source: Processor
de: Prozessor

source: Architecture
de: Architektur

source: Page size
de: Seiten größe

source: Storage
de: Speicher

source: Size
de: Größe

source: Free
de: Frei

source: Refresh
de: Aktualisieren

source: Power status
de: Energie Status

source: AC Power Status
de: AC Energie Status

source: Online
de: Angeschlossen

source: Offline
de: Getrennt

source: Backup Power
de: Reserve Energie

source: Invalid
de: Ungültig

source: Main Battery
de: Hauptbatterie

source: LifePercent
de: Lebenszeit

source: LifeTime
de: Lebensdauer

source: FullLifeTime
de: Gesamte Lebensdauer

source: Backup Battery
de: Sicherungs Batterie

source: Software Manager
de: Programme verwalten

source: Installed Software
de: Installierte Programme

source: Uninstall
de: Deinstallieren

source: PasswordDialog
de: PasswortDialog

source: Password
de: Passwort

source: Enter Password for
de: Passwort für

source: Password:
de: Passwort:

source: Remember Password
de: Speichere Passwort

source: Pda Configuration
de: PDA Konfiguration

source: Enable Masquerading:
de: Aktiviere Masquerading

source: Synchronization Settings
de: Synchronisationseinstellungen

source: Possible Synchronization Types
de: Mögliche Synchronisationstypen

source: Syncronize at PDA-Connect
de: Synchronisiere automatisch nach verbinden

source: Config
de: Konfiguration

source: Remove Partnership
de: Entferne Partnerschaft

source: There are already two partnerships configured on the device.<br>You have to delete at least one before you can set up a new partnership.
de: Es existieren schon zwei Partnerschaften auf ihrem Gerät.<br>Sie müssen zumindest eine Partnerschaft löschen bevor Sie eine neue erstellen können.

source: Current Partnerships
de: Aktuelle Partnerschaft

source: Remove marked Partnerships
de: Entferne markierte Partnerschaften

source: Execute on PDA
de: Ausführen auf dem PDA

source: File to execute: (rapip:/)
de: Auszuführendes Programm: (rapip:/)

source: Execute
de: Ausführen

source: Replication
de: Synchronisieren

source: Replication Task
de: Synchronisations Aufgabe

source: Comment
de: Kommentar

source: Progress
de: Fortschritt

source: <p align="center">Welcome to Raki</p>
de: <p align="center">Willkommen zu Raki</p>

source: (c) 2003, 2004 by V. Christian
de: (c) 2003, 2004 bei V. Christian

source: You have either started Raki for the first time, or you have just
de: Sie haben Raki zum ersten Mal gestartet oder sie haben gerade

source: upgraded from a previous release. In case of upgrade, please
de: von einer früheren Version hochgerüstet. Im Falle des Hochrüstens, bitte

source: remove your previous raki.sh script from the ~/.synce/scripts
de: entfernen sie ein etwahiges raki.sh skript vom ~/.synce/scripts

source: directory before you continue.
de: Verzeichnis bevor sie fortfahren.

source: In order to work properly, Raki needs to know
de: Um richtig zu funktionieren, Raki muss wissen,

source: the version of dccm you want to use. It is
de: welche Version von dccm sie benutzen wollen. Es

source: recommended to use vdccm because it enables
de: wird empfohlen vdccm zu benutzen. Es ermöglicht

source: the "multiple-devices" feature of Raki.
de: die "multiple-device" Fähigkeit von Raki

source: This dialog will not appear again!
de: Dieser Dialog wird nicht wieder erscheinen!

source: Removing partnerships
de: Entferne Partnerschaft

source: RRA-Connect
de: RRA-Verbinden

source: RRA-Disconnect
de: RRA-Trennen

source: -------- unchanged --------
de: ---------- unverändert -------------

source: --------- changed ---------
de: ----------- verändert -------------

source: --------- deleted ---------
de: ----------- gelöscht -----------

source: Waiting...
de: Warten...

source: Select Name:
de: Wähle Namen:

source: Library:
de: Bibliothek:

source: Services for
de: Dienst für

source: Open Name:
de: Öffne Namen:

source: There was an error:
de: Ein Feher ist aufgetreten:

source: Library no Raki-Plugin
de: Bibliothek ist kein Raki-Plugin

source: No Synchronizer found for
de: Kein Synchronizer gefunden für

source: Wrong library type for
de: Falscher Bibliothekstyp für

source: Started
de: Gestartet

source: Started syncing with
de: Synchronisierung gestartet mit

source: Finished syncing with
de: Synchronisierung abgschlossen mit

source: Finished
de: Beendet

source: Error during synchronization
de: Fehler während des Synchronisierens

source: CurrentTime (UTC):
de: Aktuelle Zeit (UTC):

source: CurrentTime (LOCAL):
de: Aktuelle Zeit (LOCAL):

source: Daylight
de: Tageslicht

source: ERROR ON COMMAND
de: FEHLER BEI COMMANDO

source: AvantGo error on asStartServer:
de: AvantGo Fehler bei asStartServer:

source: Beginning synchonization attempt on server.
de: Synchronisationsversuch mit Server.

source: Failed to retrieve device information!
de: Fehler beim Auslesen der Geräteinformationen

source: Avantgo error on asEndServer:
de: AvantGo fehler bei asEndServer

source: The AvantGo Client has been installed on your device. Please finish the installation on the device but do not restart it until the first synchronization has finished! Press <OK> to start syncing your AvantGo channels
de: Der AvantGo-Client wurde auf ihrem Gerät installiert. Bitte beenden sie die Installation auf ihrem Gerät aber starten sie das Gerät nicht neu, bis die erste Synchronisation beendet wurde! Drücken Sie <OK> um die Synchronisation zu starten.

source: AvantGo Client installed
de: AvantGo-Client installiert

source: Failed to receive user configuration from device.
de: Fehler beim Auslesen der Benutzerinformationen vom Gerät.

source: Processing %1 servers.
de: Bearbeite %1 Server

source: Failed to store user configuration to device.
de: Fehler beim Speichern der Benutzerinformationen am Gerät.

source: Using HttpProxy
de: Verwende HttpProxy

source: Using HttpProxy Authentification
de: Verwende HttpProxy Authentifizierung

source: Using SocksProxy
de: Verwende SocksProxy

source: Server/Client Setting
de: Server/Client Einstellungen

source: Server Setting
de: Server Einstellungen

source: Client Setting
de: Client Einstellungen

source: Install AvantGo Client-Software on the Device at next Sync
de: AvantGo Client-Software beim nächsten synchronisieren installieren

source: It's best practis to let it like it is.
de: Am besten so lassen wie es ist.

source: Proxy Setting
de: Proxy Einstellungen

source: Use Authentication
de: Authentication notwendig

source: Username:
de: Benutzername:

source: Active Proxy
de: Proxy aktiv

source: No Proxy
de: Kein Proxy

source: Server address
de: Server Adresse

source: Hostname:
de: Server Name

source: Your account
de: Ihr Account
